Revit 2021.1 API
StairsEditScope Properties
The StairsEditScope type exposes the following members.
Properties
Name | Description
IsActive
 Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
 (Inherited from EditScope.)
IsPermitted
 Tells if the StairsEditScope is permitted to start.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from EditScope.)
See Also
StairsEditScope Class
Autodesk.Revit.DB Namespace